


export const pretestQuestions = [
  {
    id: 1,
    ch: 3,
    content: "عبارة عن جھاز الكتروني یقوم باستقبال المدخلات البیاناتinput ، ویخزنھا داخلیاً ثم یقوم بمعالجتھا للحصول على النتائج المطلوبة وتسمى المخرجات  المعلومات output:",
    choices: ["لوحة المفاتيح", " الطابعة", "الحاسب الآلي", "التلفاز"],
    answer: 2,
    reason:
      "الحاسب الآلي كنظام ھو: عبارة عن أجزاء ترتبط ببعضھا البعض وتعمل سویاً لتحقیق مھمة معینة وھي معالجة البیانات.",
  },
  {
    id: 2,
    ch: 1,
    content: "هي طریقة إبداعیة لتقدیم بیئة تفاعلیة متمركزة حول المتعلمین ومٌصمّصة مسبقاً بشكل جید، ومیسرّة لأي فرد، وفي أي مكان، وأي وقت:",
    choices: ["التعليم الإلكتروني", "التعليم التقليدي", "التعليم المنهجي", "التعليم العصري"],
    answer: 0,
    reason:
      "يمكن أن ینظر إلى التعلم الإلكتروني على أساس أنھا طریقة إبداعیة لتقدیم بیئة تفاعلیة، متمركزة حول المتعلمین، ومٌصمّصة مسبقاً بشكل جید، ومیسرّة لأي فرد، وفي أي مكان، وأي وقت، باستعمال خصائص ومصادر الإنترنت والتقنیات الرقمیة بالتطابق مع مبادئ التصمیم التعلیمي المناسبة لبیئة التعلم المفتوحة، والمرنة، والموزعة.",
  },
  {
    id: 3,
    ch: 4,
    content: `الأجھزة توصل على شكل دائري تسیر البیانات في اتجاه واحد من جھاز لآخر، میزة ھذه التقنیة أن كل جھاز یعتبر مكرر Repeater وهو جھاز لتقویة إشارات الشبكة لتتمكن من السفر لمسافات بعیدة\n. كما أنھا تنقل حجم كبیر من البیانات،
    أما عیبھا أن جھاز واحد فقط یرسل البیانات في وقت محدد.`,
    choices: ["شبكة ذات بنیة نجمیة Star Topology", "شبكة ذات بنیة حلقیة Ring Topology", "شبكات ذات بنية معشقة Mesh Topology ","شبكة ذات بنیة خطیة Bus Topology"],
    answer: 1,
    reason:
      `البنیة الطبوغرافیة Topologies هي عملیة تنظیم الكمبیوترات والكیابل على الشبكة، یجري تنظیم الشبكات وفق بعض الأشكال القیاسیة التي تعتمد تسمیتھا وطریقة عملھا على طریق توزیع الأجھزة المتصلة بالشبكة – مكانیا –بالنسبة لبعضھا البعض.
      بالإضافة الى شبكة ذات بنیة حلقیة Ring Topology`,
  },
  {
    id: 4,
    ch: 6,
    content: `برامج تتم كتابتھا بغرض إلحاق الضرر بحاسب آخر، أو السیطرة علیه، وتتم كتابتھا بطریقة معینة:`,
    choices: ["نظم التشغيل", "برامج تحرير النصوص", "الفيروسات", "برامج الألعاب"],
    answer: 2,
    reason:
      `الفیروس:
      ھو برنامج حاسوبي یتطفل على برنامج آخر یسمى المضیف (الحاضن)، یقوم بعملیة التكاثر لمھاجمة برامج جدیدة ویكون مصمماً ومبرمجاً لمھاجمة برامج محددة معروفة وكثیرة الاستخدام.
      یتمتع الفیروس بعدة مواصفات:
       • الفیروس برنامج ضیف یتطفل على برنامج آخر یسمى المضیف (الحاضن).
       • یقوم بعملیة التكاثر لمھاجمة برامج جدیدة كما یستطیع تكرار نفسه في ذاكرة الحاسوب.
       • تتراوح خطورته من المتوسط عبر إبطاء الحاسوب أو تخریب بعض الملفات، إلى المدمرة عبر تعطیل نظام التشغیل.
       • یكون مصمما ومبرمجا لمھاجمة برامج محددة معروفة وكثیرة الاستخدام.
       • یعدل البیانات الخاصة بالبرامج والملفات التي یھاجمھا.
       • یصیب الھدف مرة واحدة ویحتفظ بتوقیعه داخل بیانات الھدف مما یساعده في استذكار مھاجمته له.
       • قابل للتغییر والتبدل في بعض الحالات لمنع اكتشافه.
     • یترك البرامج المصابة تعمل على نحو مقبول لفترة من الزمن.`,
  },
  {
    id: 5,
    ch: 5,
    content: `أوراكل (Oracle) مثال على:`,
    choices: ["نظام التشغيل", "نظام إدارة قاعدة البیانات", "محرر نصوص", "برنامج تحرير الرسوم"],
    answer: 1,
    reason:
      `نظام إدارة قاعدة البیانات Database Management System (DBMS)
      ھو البرنامج الذي یتم من خلاله استرجاع البیانات، أو الإضافة أو التعدیل علیھا، أو حذفھا، حیث یقوم البرنامج بالربط بین المستخدم وبین محرك قاعدة البیانات، لأداء تلك المھمة.`,
  },
  {
    id: 6,
    ch: 6,
    content: `عندما یصیب الفيروس ملفاً أو برنامجاً أو قطاعاً من قطاعات القرص الصلب یترك ضمن العنصر المصاب مجموعة من البیانات الخاصة به تسمى:`,
    choices: ["توقيع الفيروس", "آثار الفيروس", "بصمة الفيروس", "خطة الفيروس"],
    answer: 0,
    reason:
      `یعود السبب في ترك الفیروس لتوقیعه إلى حاجته للتعرف على الملفات التي أصابھا
      خلال جولاته ضمن الحاسوب حتى لا یعود لتكرار عمل غیر مجد بإصابتھا مرة أخرى
      لذلك تعتمد مضادات الفیروسات على  (Signature Scanning)للتعرف على الفیروس عن طریق توقیع الفیروس من خلال مطابقة التوقیع الذي یتركه الفیروس ضمن الملف مع قاعدة بیانات خاصة بمضاد الفیروسات تحتوي على مجموعة كبیرة من تواقیع الفیروسات.`,
  },     {
    id: 7,
    ch: 1,
    content: `من المتطلبات المادیة المرتبطة بالأجھزة والمعدات والبرمجیات(البنیة التحتیة) في التعلم الإلكتروني:`,
    choices: ["برامج التواصل الاجتماعي", "التلفزيونات الذكية", "أجهزة الحاسب", "برامج تحرير الصور"],
    answer: 2,
    reason:
      `يمكن إجمال أھم المتطلبات المادیة للتعلیم الإلكتروني فیما یلي:
      ▪ أجھزة الحاسب
      ▪ شبكة الإنترنت
      ▪ برمجیات التشغیل
      ▪ برامج التحكم في الوسائط المتعددة
      ▪ الأقراص المدمجة
      ▪ الكتاب الإلكتروني
      ▪ المكتبة الإلكترونیة `,
  }, {
    id: 8,
    ch: 3,
    content: `عبارة عن شریحة الكترونیة مصنعة من السلیكون التي تحتوي على العدید من الدارات الالكترونیة الموصلة باللوحة الام Motherboard :`,
    choices: ["المعالج", "الطابعة", "الذاكرة", "نظام التشغيل"],
    answer: 0,
    reason:
      `المعالج: عبارة عن شریحة الكترونیة مصنعة من السلیكون التي تحتوي على العدید من الدارات
      الالكترونیة الموصلة باللوحة الام Motherboard لتقوم باستقبال البیانات (وحدات الادخال)،
      ثم معالجتھا وتخزینھا واخراجھا (وحدات الاخراج) .`,
  },
  {
    id: 9,
    ch: 4,
    content: `البرنامج الذي یسمح بالبحث ضمن الوثائق (صفحات ویب 
      صور  ملفات) الموجودة على مواقع الویب:`,
    choices: ["محرر النصوص", "المتصفح", "محرك البحث", "قاعدة البيانات"],
    answer: 2,
    reason:
      `أنواع محركات البحث:
     المحركات العامة: ھي المحركات التي تبحث في جمیع وثائق الویب التي تفھرسھا وأشھرھا: Google وYahoo
      و المحركات البینیة: ھي المحركات التي توجه بحثھا إلى مجموعة مختارة من محركات البحث العامة وأشھرھا: Met Crawler وStarting Point`,
  },
  {
    id: 10,
    ch: 2,
    content: `ھي مجموعة من البیانات المعُالجة والتي تعطي فائدة أو قیمة محددة نتیجةً لإجراء بعض العملیات علیھا.`,
    choices: ["المعلومات", " البيانات", "المتغيرات", "الحقائق"],
    answer: 0,
    reason:
      `الفرق بین البیانات والمعلومات أن المعلومات تٌعطي نتیجة محددة أو فائدة محددة وتحتاج
      للمعالجة. مثال:
      المعالجة: حساب المتوسط الحسابي
      النتیجة(المعلومات)`,
  },
];



export const ch1 = [
  {
    id: 1,
    ch: 1,
    content: "هي طریقة إبداعیة لتقدیم بیئة تفاعلیة متمركزة حول المتعلمین ومٌصمّصة مسبقاً بشكل جید، ومیسرّة لأي فرد، وفي أي مكان، وأي وقت:",
    choices: ["التعليم الإلكتروني", "التعليم التقليدي", "التعليم المنهجي", "التعليم العصري"],
    answer: 0,
    difficulty : "سهل",
    reason:
      "يمكن أن ینظر إلى التعلم الإلكتروني على أساس أنھا طریقة إبداعیة لتقدیم بیئة تفاعلیة، متمركزة حول المتعلمین، ومٌصمّصة مسبقاً بشكل جید، ومیسرّة لأي فرد، وفي أي مكان، وأي وقت، باستعمال خصائص ومصادر الإنترنت والتقنیات الرقمیة بالتطابق مع مبادئ التصمیم التعلیمي المناسبة لبیئة التعلم المفتوحة، والمرنة، والموزعة.",
  }, {
    id: 2,
    ch: 1,
    content: "أسلوب مخطط ومّنظم یستھدف تنمیة مھارات المتعلمین عن بٌعد:",
    choices: ["التعليم العصري", "التعليم عن بعد", "التعليم المنهجي", "الأسلوب المنظم"],
    answer: 1,
    difficulty : "سهل",
    reason:
      "التعلم عن بعد ھو أسلوب مخطط ومّنظم یستھدف تنمیة مھارات المتعلمین عن بٌعد، باستخدام تكنولوجیا الاتصال العصریة، لتقریب المسافات المكانیة والزمانیة بین المتعلمین ومعلمیھم وتحقیق التفاعل بینھم ؛ وصولاً إلى إتقان المھارات وتوجیه الاتجاھات وفق ما یستجد من احتیاجات.",
  },{
    id: 3,
    ch: 1,
    content: "من أهداف التعلم الإلكتروني:",
    choices: ["نشر ثقافة التقنیة، وتدعیم بناء المجتمع المعرفي.", "تعزيز العزلة الاجتماعية وتقليل التفاعل الشخصي", "زيادة التكاليف الاقتصادية وتعقيد العمليات الإدارية", "الحد من الابتكار التكنولوجي والاعتماد على الطرق التقليدية."],
    answer: 0,
    difficulty : "سهل",
    reason:
      `أيضا من أھداف التعلم الإلكتروني:
    1. توفیر فرص التعلم لكل الأفراد الذین لم تتاح لھم الفرصة للالتحاق بمؤسسات التعلیم المختلفة.
    2. الإسھام في تلبیة احتیاجات سوق العمل بتوفیر الكفاءات المدربة.
    3. إتاحة الفرصة للأفراد للحصول على التعلیم والتدریب.
    4. التغلب على العوائق المكانیة والزمانیة للتعلم.
    5. تنوع مصادر المعلومات، وتطویر قدرات المتعلمین.
    6. توفیر بیئة تعلیمیة متعددة مصادر المعرفة.
    7. نمذجة التعلیم وإعادة الاستفادة من المناھج.
    8. سرعة تطویر المناھج والبرامج لمواكبة العصر.
    9. دعم دور المتعلم كأساس لعملیة التعلم، وكذلك المؤسسة التعلیمیة.
`,
  },
  {
    id: 4,
    ch: 1,
    content: `مانوع التعلم الذي فيه یتم نقل المعلومات والدروس والامتحانات وتبادلھا في نفس الوقت الفعلي للمادة مثل المحادثات الفوریة؟`,
    choices: ["التعلم المباشر(المتزامن) Synchronous E-Learning","التعلم غير المباشر (الغير متزامن) Asynchronous E-Learning"],
    answer: 0,
    difficulty : "سهل",
    reason: `التعلم الإلكتروني المباشر(المتزامن) يستخدم أدوات تسمح للمستخدم بالاتصال المبُاشر بالمستخدمین الآخرین على الشبكة، ومن أھم هذه الأدوات:
•	(chat) المحادثة: ھي إمكانیة التحدث مع الآخرین عبر الشبكة فوریاً سواء كتابیا أو صوتیا أو بالفیدیو.
•	(Audio Conferences) المؤتمرات الصوتیة: ھي تقنیة إلكترونیة تعتمد على الانترنت والھاتف لتوصیل المحادثة بین المتحدث كفرد وعدد من المستقبلین في أماكن متفرقة.
•	 (Video Conferences) مؤتمرات الفیدیو: ھي المؤتمرات التي یتم التواصل بین الأفراد فیدویاً عبر مسافات بعیدة ، وتسمح للمتواجدین من النقاش والحوار والتواصل فیما بینھم.
•	(Satellite Programs) برامج القمر الصناعي: ھي توظیف برامج القمر الصناعي عبر الشبكة للاستفادة من القنوات السمعیة والبصریة في عملیات التدریس والتعلم.
`,
  },
  {
    id: 5,
    ch: 1,
    content: `مانوع التعلم الذي فیه یحصل المتعلم على المھارات التي یھدف الوصول إلیھا، من خلال برنامج مخطط ومحدد حیث یتعلم حسب مایلائمه من وقت ومع یتناسب مع ظروفه.`,
    choices: ["التعلم المباشر(المتزامن) Synchronous E-Learning","التعلم غير المباشر (الغير متزامن) Asynchronous E-Learning"],
    answer: 1,
    difficulty : "سهل",
    reason: `التعلم الإلكتروني غير المباشر(الغيرمتزامن) يستخدم ادوات تسمح للمستخدم بالتواصل مع المستخدمین الآخرین بشكل غیر مباشر (أي لا تتطلب تواجد المستخدمین على الشبكة معاً أثناء التواصل)، من هذه الأدوات:
•	(E-mail) البرید الإلكتروني: ھي إمكانیة تبادل الرسائل والوثائق بین المشتركین من خلال شبكة الإنترنت.
•	(Discussion Groups) مجموعات النقاش: ھي إحدى أدوات الاتصال عبر شبكة الانترنت بین مجموعة من الأفراد ذوي الاھتمام المشترك.
•	(Interactive Video) الفیدیو التفاعلي: ھي التقنیة التي تتیح إمكانیة التفاعل بین المتعلم والمادة المعروضة، من اتجاه واحد ھو المتعلم.
•	(Mailing List) القوائم البریدیة: عبارة عن مجموعة من العناوین البریدیة المجتمعة، والتي تمكنھم من التواصل فیما بینھم.
`,
  },
  {
    id: 6,
    ch: 1,
    content: `من المتطلبات المادیة المرتبطة بالأجھزة والمعدات والبرمجیات(البنیة التحتیة) في التعلم الإلكتروني:`,
    choices: ["برامج التواصل الاجتماعي", "التلفزيونات الذكية", "أجهزة الحاسب", "برامج تحرير الصور"],
    answer: 2,
    difficulty : "متوسط",
    reason:
      `يمكن إجمال أھم المتطلبات المادیة للتعلیم الإلكتروني فیما یلي:
      ▪ أجھزة الحاسب
      ▪ شبكة الإنترنت
      ▪ برمجیات التشغیل
      ▪ برامج التحكم في الوسائط المتعددة
      ▪ الأقراص المدمجة
      ▪ الكتاب الإلكتروني
      ▪ المكتبة الإلكترونیة 
      ▪ المعامل الإلكترونیة
      ▪ مٌعلمو مصادر التقنیة`,
  },
  {
    id: 7,
    ch: 1,
    content: "من المتطلبات البشرية في فريق المشروع التعليمي في التعليم الإلكتروني ويعتبر المسؤول عن تقديم وتصميم المحتوى التعليمي ووضع خطط العمل:",
    choices: ["مصمم المحتوى التعليمي", "مصمم الرسوم ", "مدير المشروع", "المبرمج"],
    answer: 0,
    difficulty : "متوسط",
    reason:
      `أيضا من المتطلبات البشریة (فریق المشروع التعلیمي) في التعلیم الإلكتروني:
      • مدير المشروع :(Project Manager) وھو الشخص المسؤول عن قیادة وإدارة فریق العمل بأكمله.
      • مدیر النظام (System Manager): وھو الشخص المسؤول عن توفیر الدعم والتوجیه الفني للبرنامج، والمشاركة في الاختیار.
      • الخبیر المتخصص في الموضوع التعلیمي: وھو الشخص المشارك في مرحلة تقییم احتیاجات المتعلمین، ومراجعة مخططات العمل.
      • المبرمجون (Programmers): تقع علیھم مسئولية مراجعة التصمیم، والإعداد باستخدام برامج الكمبیوتر المتخصصة.
      • أخصائي الرسوم (Graphic Artist): وھو المسؤول عن تقدیم المساعدة في مجال التصمیم وتحویله للمحتوى التعلیمي.
      • أخصائي الشبكة وھو المسؤول عن صیانة خادم الشبكة، والموقع دوریاً.
      • المعلم (Instructor): وھو المسؤول عن تقدیم المحتوى تزامننا أو غیر متزامن، والمشاركة في الإعداد والتقییم.
  `,
  },
  {
    id: 8,
    ch: 1,
    content: "من مُبرّرات استخدام التعلم الإلكتروني:",
    choices: ["إمكانية الوصول للمناھج في أي وقت.", "تعزيز العزلة الاجتماعية وتقليل التفاعل الشخصي.", "زيادة التكاليف الاقتصادية وتعقيد العمليات الإدارية.", "الحد من الابتكار التكنولوجي والاعتماد على الطرق التقليدية."],
    answer: 0,
    difficulty : "متوسط",
    reason:
      `هناك العديد من المبررات لاستخدام التعلم الإلكتروني كـ:
      1. إیجاد طرق ممیزة لعرض المناھج عبر شبكة الإنترنت.
      2. إیجاد حلولاً لمشكلة الأعداد الكبیرة.
      3. زیادة وتدعیم مصادرة المعرفة المختلفة.
      4. مراعاة الفروق الفردیة بین المتعلمین.
      5. التقییم الفوري والحصول على النتائج وتصحیح الأخطاء.`,
  },
  {
    id: 9,
    ch: 1,
    content: "من معوقات التعلم الإلكتروني:",
    choices: [".الإسھام في تلبیة احتیاجات سوق العمل بتوفیر الكفاءات المدربة.", "الخصوصیة والسریة واحتمالیة الھجوم والقرصنة للأنظمة وللمقررات.", "التغلب على العوائق المكانیة والزمانیة للتعلم.", "تنوع مصادر المعلومات، وتطویر قدرات المتعلمین."],
    answer: 1,
    difficulty : "متوسط",
    reason:
      `كذلك من معوقات التعلم الإلكتروني:
      1. التطور السریع في المعاییر القیاسیة العالمیة ، مما یتطلب تعدیلات وتحدیثات للمقرر الإلكتروني باستمرار.
      2. مقاومة بعض المتعلمین لھذا النمط من التعلم، وانعدام التفاعلیة.
      3. الاتجاه السلبي من قبل بعض أعضاء ھیئة التدریس ضد التعلم الإلكتروني.
      4. المشاكل التقنیة والفنیة كأنظمة الاتصال والدعم.
      5. عدم وجود الوعي الكافي من بعض أفراد المجتمع لنمط ھذا التعلم.
      6. الحاجة المستمرة لتدریب المتعلمین والمعلمین لكیفیة التعلم والتعلیم الإلكتروني.
      7. الحاجة إلى نشر مقررات إلكترونیة بجودة عالیة من الجودة للمنافسة.
  `,
  },
  {
    id: 10,
    ch: 1,
    content: "من اهم المتطلبات التنظیمیة للتعليم الإلكتروني:",
    choices: ["توفیر بیئة تعلیمیة محدودة مصادر المعرفة.", "عدم الاستفادة من المناھج السابقة.", "تطویر المناھج والبرامج لمواكبة العصربسرعة محددة.", "تطبیق معاییر الجودة الشاملة على برامج التعلم الإلكتروني. "],
    answer: 3,
    difficulty : "متوسط",
    reason:
      `كذلك من المتطلبات التنظیمیة للتعليم الإلكتروني:
      ▪ توفیر المناخ التعلیمي المناسب لأسلوب التعلم الإلكتروني.
      ▪ دراسة التجارب السابقة في مجال التعلم الإلكتروني، ومحاولة الاستفادة منھا.
      ▪ الإشراف الأكادیمي على برامج التعلم الإلكتروني، وتوفیر الحوافز في ھذا المجال.
      ▪ مسایرة التطورات السریعة في مجال المھارات والمناھج الدراسیة الإلكترونیة.
      ▪ الإعلام والترویج لأھمیة التعلیم الإلكتروني بالمنظمة، والتعریف ببرامج التعلم واستخدامھا.`,
  },
  {
    id: 11,
    ch: 1,
    content: `عبارة عن نظام صمم للمساعدة في إدارة ومتابعة وتقیم التعلیم والتدریب وجمیع أنشطة التعلم في المنشآت (الجھة المستفیدة) عبر شبكة (الإنترنت).`,
    choices: ["نظام إدارة التعلیم الإلكتروني","نظام إدارة قواعد البيانات" ,"نظام إدارة الملفات","نظام إدارة محتوى التعلم"],
    answer: 0,
    difficulty : "متوسط",
    reason: `نظام إدارة التعلیم الإلكتروني (Learning Management System)(LMS) یتمیز بأنه یُمكّن المنشأة التعلیمیة من إدارة وتنظیم البرامج الدراسیة والدورات التعلیمیة. ويقدم الخدمات التالية:
•	التسجیل: تعني إدراج وإدارة بیانات المتدربین(المتعلمین).
•	الجدولة: تعني جدولة المقرر، ووضع خطة التدریب.
•	التوصیل: وتعني إتاحة المحتوى للمتدرب(للمتعلم).
•	التتبع: وتعني متابعة أداء المتدرب(المتعلم) وإصدار التقاریر.
•	الاتصال: تعني التواصل بین المتدربین من خلال الدردشات، ومنتدیات النقاش وغیرھا.
•	الاختبارات: وتعني إجراء اختبارات للمتعلمین وتقییمھم.
من الأمثلة على هذا النظام:
•	(Moodle)
•	(Dokeos)
•	(ATutor)
•	نظام (تدارس) ونظام مجد لإدارة التعلیم الإلكتروني
`,
  },
  {
    id: 12,
    ch: 1,
    content: `عبارة عن حزم(مجموعة)برامج متكاملة تُشكل نظاماً لإدارة المحتوى المعرفي (العلمي) المطلوب تعلمه أو التدرب علیه، وتوفر أدوات للتحكم في عملیة التعلم ویتم تشغلیھا على الشبكة(الإنترنت).`,
    choices: ["نظام إدارة قواعد البيانات" ,"نظام إدارة الملفات","نظام إدارة التعلیم الإلكتروني","نظام إدارة محتوى التعلم"],
    answer: 3,
    difficulty : "متوسط",
    reason: `نظام إدارة محتوى التعلیم الإلكتروني (Learning Content Management System) (LCMS) تختلف عن (LMS) بتركیزھا على المحتوى التعلیمي من إنشائه وتطویره وتعدیله بشكل أكثر فاعلیة من خلال الاستفادة من المستودع التعلیمي Repository الذي یحتوي على العناصرالتعلیمیة للمقرر Learning Objectsبحیث یسھل توزیعھا وتجمعیھا وكذلك إعادة استخدامھا بما یتناسب مع عناصر العملیة التعلیمیة. ويقدم الخدمات التالية:
•	إنشاء محتوى جدید.
•	تطویر المحتوى وإدارته.
•	استیراد المحتوى ونشره.
•	إمكانیة تجزئة المحتوى الإلكتروني إلى مكوناته الأصلیة، وجعله قابل للاسترجاع وفق متطلبات التعلم.
•	إمكانیة ضم جزئیات المحتوى الإلكتروني المختلفة.
من امثلة هذا النظام:
برنامج البلاك بورد   (Blackboard)وھو نظام إدارة تعلم تجاري من شركة بلاك بورد، وھو النظام المستخدم في التعلم الإلكتروني في جامعة الملك خالد، ویتمّیز بالمرونة وقابلیته للتطویر والتوسع.
`,
  },

  {
    id: 13,
    ch: 1,
    content: "هناك عدة نماذج لتوظیف التعلم الإلكتروني في التدریس احدها عبارة عن تعلیم إلكتروني مٌكمّل للتعلیم التقلیدي ، وفیه توظف بعض أدوات التعلیم الإلكتروني جزئیاً في دعم التعلیم الصفي التقلیدي، وتسھیله ورفع كفاءته. يسمى هذا النموذج:",
    choices: ["النموذج المساعد", "النموذج المشارك","النموذج الممزوج", "النموذج الخالص"],
    answer: 0,
    difficulty : "صعب",
    reason:
      `أمثلة على تطبیقات النموذج المساعد او المكمل (Supportive e-learning) مایلي:
      • قیام المعلم بتوجیه الطلاب للاطلاع على دروس معینة على شبكة الإنترنت أو على قرص مدمج.
      • قیام المعلم بتكلیف الطلاب بالبحث عن معلومات معینة على شبكة الإنترنت.
      • توجیه الطلاب لحل بعض الأسئلة على مواقع الإنترنت ذات الصلة بالدرس التعلیمي.`,
  },
  {
    id: 14,
    ch: 1,
    content: `من نماذج توظيف التعلم الإلكتروني في التدريس یوظف فيه التعلیم الإلكتروني وحده في إنجاز عملیة التعلم والتعلیم، حیث
    تعمل الشبكة كوسیط أساسي لتقدیم كامل عملیة التعلیم وھو صورة للتعلیم عن بٌعد المعتمد على التعلیم الإلكتروني. ویتم التواصل بین المعلم والمتعلم عبرالشبكة (الإنترنت) بشكل كامل. يسمى هذا النموذج:`,
    choices: ["النموذج المساعد","النموذج المشارك", "النموذج الممزوج", "النموذج الخالص"],
    answer: 3,
    difficulty : "صعب",
    reason: `مثال على تطبیقات النموذج الخالص او الكامل (Full e-learning) مایلي:
    أن یتعلم الطالب تشاركیاً من خلال مشاركته لمجموعة معینة في تعلم درس أو إنجاز مشروع بالاستعانة بأدوات التعلیم الإلكتروني التشاركي مثل (غرف المحادثة- مؤتمرات الفیدیو ).`,
  },
  {
    id: 15,
    ch: 1,
    content: `من نماذج توظيف التعلم الإلكتروني في التدريس ماهو عبارة عن تعلیم إلكتروني ممزوجاً مع الأسلوب التقلیدي، وفیه یتم دمج أسالیب تقدیم مختلفة تؤدي إلى الاستفادة من البرامج المقدمة، والتي تزید من فعالیة التعلم وتقلل تكلفته بالإضافة إلى تحسین فعالیة التعلیم من خلال توفیر تناغم وانسجام أكثر مابین متطلبات المتعلم والبرنامج التعلیمي المقدّم. يسمى هذا النموذج:`,
    choices: ["النموذج المساعد", "النموذج الممزوج", "النموذج المشارك","النموذج الخالص"],
    answer: 1,
    difficulty : "صعب",
    reason: `مثال على تطبیقات النموذج الممزوج (Blended e-learning) مایلي:
قیام المعلم بتدریس درس معین أو أكثر من دروس المقرر داخل الصف الدراسي(التقلیدي) دون استخدام أدوات التعلیم الإلكتروني، وتعلیم درس آخر أو بعض دروس المقرر باستخدام أدوات
التعلیم الإلكتروني، ویتم التقویم باستخدام أسالیب التقویم التقلیدي والإلكتروني تبادلیاً.
`,
  },

]

// ch1.forEach((question) => {
//   question.content = formatContent(question.content);
// });

export const ch2 = [
{
    id: 1,
    ch: 2,
    content: `الوحدة الأساسیة التي تٌقاس بھا البیانات أو المعلومات ھي:`,
    choices: ["الهرتز", "الجيجا ", "البایت", "الثانية"],
    answer: 2,
    difficulty : "سهل",
    reason:
      `الوحدة الأساسیة التي تٌقاس بھا البیانات أو المعلومات ھي البایت Byte ومضاعفاتھا كما یلي:
•	بایت = ٨ بت
•	كیلو بایت = ١٠٢٤ بایت
•	میغا بایت = ١٠٢٤ كیلو بایت
•	قیقا بایت = ١٠٢٤ میغا بایت
•	تیرا بایت = ١٠٢٤ قیقا بایت
      `,
  },
  {
    id: 2,
    ch: 2,
    content: `تصمم ھذه الحاسبات للقیام بالعدید من الأعمال، أي أنھا لیست مقصورةعلى غرض معین.`,
    choices: ["حاسب متعدد الأغراض","حاسب عملي", "حاسب متنوع التصاميم" ,"حاسب متخصص"],
    answer: 0,
    difficulty : "سهل",
    reason:
      `تصنف الحاسبات حسب الغرض من الاستخدام الى:
      • الحاسب متعدد الأغراض: تصمم ھذه الحاسبات للقیام بالعدید من الأعمال، أي أنھا لیست مقصورة على غرض معین.
      • الحاسب المتخصص: حاسبات صٌممت لأغراض خاصة ومحددة مثل المركبات الفضائیة أو أجھزة التحكم في السیارات الحدیثة.`,
  },
  {
    id: 3,
    ch: 2,
    content: `ھي مجموعة من الحقائق والمفاھیم الخام التي یعالجھا الحاسب للحصول على نتائج معینة.`,
    choices: ["المعلومات", " البيانات", "المتغيرات", "الحقائق"],
    answer: 1,
    difficulty : "متوسط",
    reason:
      `تصنف البيانات حسب أشكالھا إلى نوعین:
      • ثابتة: قیم محددة لا تتغیر. مثال: الأرقام العشریة أو الحروف الھجائیة.
      • متغیرة: قیم عدیدة ومختلفة. مثال: درجة الحرارة أو سرعة الریح.
  ايضاً تصنف البيانات حسب طریقة المعالجة إلى نوعین:
      • رقمیة: تُعالج بواسطة الحاسب الرقمي Digital Computer وتشمل بیانات ثابتة (حرفیة أو عددیة)
      • قیاسیة: تُعالج بواسطة الحاسب التناظري Analog Computer وتشمل بیانات متغیرة.`,
  },
  {
    id: 4,
    ch: 2,
    content: `ھي مجموعة من البیانات المعُالجة والتي تعطي فائدة أو قیمة محددة نتیجةً لإجراء بعض العملیات علیھا.`,
    choices: ["المعلومات", " البيانات", "المتغيرات", "الحقائق"],
    answer: 0,
    difficulty : "متوسط",
    reason:
      `الفرق بین البیانات والمعلومات أن المعلومات تٌعطي نتیجة محددة أو فائدة محددة وتحتاج للمعالجة. مثال:
      البیانات: ١٠ ، ١٠ ، ٥٠ ، ١٠ ، ٢٠
      المعالجة: حساب المتوسط الحسابي
      النتیجة(المعلومات): ٢٠`,
  },  {
    id: 5,
    ch: 2,
    content: `مزیج من نوعين من أنواع الحواسيب، تتمیز بسرعة الأداء حیث تستخدم المبدأ الرقمي عند الإدخال، والمبدأ التناظري لإخراج النتائج.`,
    choices: ["الحواسيب المتكاملة","الحواسيب الرقمية", "الحواسيب التناظرية", "الحواسيب المهجنة"],
    answer: 3,
    difficulty : "متوسط",
    reason:
      `یُمكن تصنیف الحاسبات وفق التركیب التقني الذي یعتمد على طبیعة التركیب التقني ونوعیة البیانات وطرق معالجتھا إلى:
      ◦ الحواسیب التناظریة: تعتمد على مبدأ القیاس والمقارنة في العمل، باستقبال مجموعات من البیانات المتعلقة بالظواھر الطبیعیة كالحرارة التي تحول إلى كمیات ظاھریة مستمرة یتم تحویلھا على شكل منحنیات ورسوم بیانیة.
      ◦ الحواسیب الرقمیة: تعتمد على نبضات كھربائیة، تستقبل البیانات على شكل أحرف وأرقام یتم تحویلھا إلى (0،1) حيث 1 عبارة شحنة و0 عدم وجود شحنة، والعكس عند إخراج ھذه العملیات.
      ◦ الحواسيب المهجنة: مزیج من الصنفين، تتمیز بسرعة الأداء حیث تستخدم المبدأ الرقمي عند الإدخال، والمبدأ التناظري لإخراج النتائج.
`,
  },  {
    id: 6,
    ch: 2,
    content: `تمتاز بسرعة الأداء والقدرة على تنفیذ العملیات بدقة عالیة، بالإضافة إلى التكلفة المادیة المرتفعة لكن یمكن تطوریھا لاحقا.`,
    choices: ["الحواسیب الفائقة Supercomputer", "الحواسیب الكبيرة Mainframe ", "الحواسیب المتوسطة Minicomputers", "الحواسیب الصغيرة Microcomputer"],
    answer: 1,
    difficulty : "متوسط",
    reason:
      `تصنف الحواسيب استنادا إلى حجمھا وإمكاناتھا من حیث السرعة والسعة التخزینیة إلى الأنواع التالیة:
          • الحواسیب الفائقة  Supercomputer: تمتاز بالكفاءة والسرعة والقدرة التخزینیة الھائلة حیث تنفذ في زمن ١٢.٥ نانو ثانیة تستخدم في المؤسسات الضخمة ومراكز الأبحاث وشركات الطیران.
          • الحواسیب الكبیرة  Mainframe:تمتاز بسرعة الأداء والقدرة على تنفیذ العملیات بدقة عالیة ، بالإضافة إلى التكلفة المادیة المرتفعة لكن یمكن تطوریھا لاحقا.
          • الحواسیب المتوسطة Minicomputers: تعد شائعة الاستخدام بسبب تكلفتها المنخفضة مقارنة بالأنواع السابقة، وتمتاز بصغر الحجم كذلك القدرة التنفیذیة الكبیرة، تستخدم في الأغراض التجاریة والإداریة.
          • الحواسیب الصغیرة Microcomputer: تمتاز بصغر الحجم ورخص الثمن، تعتمد في تصمیمها على المعالجات الصغیرة، الذي ساعد في ظھور الحاسبات الشخصیة Personal Computer (PC)  للاستخدام الشخصي في مختلف الأغراض والمھام.`,
  }
]


export const ch3 = [
  {
    id: 1,
    ch: 3,
    content: "عبارة عن جھاز الكتروني یقوم باستقبال المدخلات البیاناتinput ، ویخزنھا داخلیاً ثم یقوم بمعالجتھا للحصول على النتائج المطلوبة وتسمى المخرجات  المعلومات output",
    choices: ["لوحة المفاتيح", " الطابعة", "الحاسب الآلي", "التلفاز"],
    answer: 2,
    difficulty : "سهل",
    reason:
      "الحاسب الآلي كنظام ھو: عبارة عن أجزاء ترتبط ببعضھا البعض وتعمل سویاً لتحقیق مھمة معینة وھي معالجة البیانات.",
  },
  {
    id: 2,
    ch: 3,
    content: `إجراء سلسلة من العملیات المنطقیة والحسابیة على مجموعات من البیانات المدخلة يسمى:`,
    choices: ["ادخال البيانات", "معالجة البيانات", "اخراج البيانات", "نمذجة البيانات"],
    answer: 1,
    difficulty : "سهل",
    reason:
      `الوظیفیة الرئیسیة للحاسب ھي معالجة البیانات  (Data Processing)وهي: إجراء سلسلة من العملیات المنطقیة والحسابیة على مجموعات من البیانات المدخلة بھدف الحصول على نتیجة معینة ومفیدة (معلومات) ، باستخدام برامج مخصصة في الحاسب.`,
  }, {
    id: 3,
    ch: 3,
    content: `من الاجزاء المادیة المكونة للحاسب الآلي:`,
    choices: ["وحدة الذاكرة الرئیسیة المركزیة Main Memory", "برامج الشبكات Network software ", "البرمجيات Software " ,"نظام التشغيل Operating System "],
    answer: 0,
    difficulty : "سهل",
    reason:
    `الاجزاء المادیة  Hardware تتكون من:
1.	المعالج او وحدة المعالجة المركزیة (Central Processing Unit )CPU وتتكون من:
•	وحدة التحكم Control Unit
•	وحدة الحساب والمنطق Arithmetic and Logic Unit
2.	وحدة الذاكرة الرئیسیة المركزیة Main Memory  وتتكون من:
•	ذاكرة الوصول العشوائي Random Access Memory (RAM)
•	ذاكرة القراءة فقط Read Only Memory(ROM)
3.	وحدة الذاكرة الثانویة (Secondary Memory) وتتكون من:
•	القرص الصلب Hard Disk
•	محرك الاقراص المرنة Floppy Disk Driver
•	محرك الاقراص اللیزریة المضغوطة  CD-Rom Driver
•	اجزاء اخرى كالقرص القابل للازالة (الفلاش)
4.	وحدات الإدخال والإخراج (I/O) وتتكون من:
•	وحدة الادخال  input مثل: لوحة المفاتیح- الماسح الضوئي – الفأرة.
•	وحدة الإخراج output  مثل: الشاشة- الطابعة- السماعات.
`
  },
   {
    id: 4,
    ch: 3,
    content: `وحدة التخزین الرئیسیة في الحاسب هي:`,
    choices: ["المعالج", "الفلاش", "الذاكرة", "نظام التشغيل"],
    answer: 2,
    difficulty : "سهل",
    reason:
      `الذاكرة ھي وحدة التخزین الرئیسیة في الحاسب وتتكون من:
      1. ذاكرة الوصول العشوائي (Random Access Memory) RAM: سُمیت عشوائیة لانه یمكن الوصول لأي عنوان داخلھا مباشرة ومن انواعھا التالي:
 • الذاكرة الدینامیكیة DRAM
 • الذاكرة الساكنة SRAM
 2. ذاكرة القراءة فقط (Read-Only Memory) ROM: نوع من الذاكرة القابلة للقراءة فقط ولا یمكن الكتابة علیھا ویتم التخزین علیھا من المصنع لھا ومن انواعھا:
 • ROM
 • PROM
 • EPROM
 • EEPROM`,
  }, {
    id: 5,
    ch: 3,
    content: `وحدة الذاكرة الرئيسية التي تخزن المعلومات بشكل دائم:`,
    choices: ["ذاكرة الوصول العشوائي (Random Access memory) RAM", "ذاكرة القراءة فقط (Read-Only Memory) ROM", "الذاكرة الدینامیكیة DRAM","الذاكرة الساكنة SRAM" ],
    answer: 1,
    difficulty : "سهل",
    reason:
      `ذاكرة القراءة فقط (Read-Only Memory) ROM:
 • تكتب(تخزن) فیھا المعلومات لمرة واحدة فقط من قبل الشركة المصنعة.
 • تستخدم لقراءة(استرجاع) المعلومات المخزنة فیھا فقط.
 • تخزن المعلومات بشكل دائم.
  اما ذاكرة الوصول العشوائي  (Random Access Memory) RAM:
   • تكتب(تخزن) فیھا المعلومات باستمرار من قبل المستخدم.
   • تستخدم لكتابة (تخزین) وقراءة (استرجاع) المعلومات المخزنة فیھا.
      • تخزن المعلومات أثناء العمل فقط.`,
  },
  {
  id: 6,
    ch: 3,
    content: `  :وظيفتها استقبال البیانات وإدخالھا ،تحویل البیانات المدخلة إلى صیغة مفھومة للحاسب وتخزین البیانات أو أجزاء منھا مؤقتا`,
    choices: ["البرمجيات Software ", "نظام التشغيل Operating System", "وحدات الإخراج Output Devices", "وحدات الادخال Input Devices"],
    answer: 3,
    difficulty : "سهل",
    reason:`
    من أھم وحدات الإدخال مایلي:
1.	لوحة المفاتیح Keyboard
وتتألف من مجموعة من المفاتیح لإدخال الرموز والأرقام والأحرف ویمكن تصنیفھا إلى:
•	مفاتیح الأسھم
•	مفاتیح الأرقام
•	مفاتیح الحروف والرموز والأرقام
•	مفاتیح الوظائف (F1, F2…)
•	مفاتیح خاصة (Ctrl, Shift, Alt, Del)
2.	الفأرة Mouse:
تستخدم لتنفیذ الاختیار اللازم للتعلیمات أو النقل أو التحریك للمؤشر على الشاشة، وتستخدم مع أنظمة التشغیل الرسومیة ، ولھا العدید من الأنواع كالیزري الضوئي.
3.	شاشة اللمس Touch screen:
تستخدم لاختیار البرنامج اللازم عبر لمس الشاشة في المكان الذي توضع فیه الأیقونة الخاصة به وتعتبر وحدة إدخال وإخراج في نفس الوقت.
4.	الماسحات الضوئیة Scanner:
تستخدم لإدخال الصور والرسوم والوثائق وإجراء التعدیل علیھا ولھا عدة أنواع منھا (قارئ الأعمدة والماسح الضوئي).
5.	الكامیرا الرقمیة.
6.	المایكروفون: الذي یستخدم لإدخال البیانات الصوتیة للحاسب.
`,
},
{
    id: 7,
    ch: 3,
    content: ` وظيفتها تحویل البیانات المدخلة إلى بیانات قابلة للعرض والإخراج، إخراج واستقبال نتائج عملیات المعالجة و حفظ البیانات المراد إخراجھا مؤقتا:`,
    choices: ["البرمجيات Software ", "نظام التشغيل Operating System", "وحدات الإخراج Output Devices", "وحدات الادخال Input Devices"],
    answer: 2,
    difficulty : "سهل",
    reason: `
      ومن أھم وحدات الإخراج مایلي:
1.	الشاشة Display:
تستخدم لعرض البیانات ومن الأمور الھامة في الشاشة ھي دقتھا Resolution وتقاس عادة بعدد النقاط Pixels التي تتحكم بإظھار الصور مثلا ٦٤٠*٤٨٠ وتعنى توفر ٤٨٠ سطرا في الشاشة للعرض وكل سطر مؤلف ٦٤٠ نقطة. ولھا العدید من الأنواع ومنھا:
•  LCD
•  LED
•  CRT
2.	الطابعة Printer :
تستخدم لإخراج المعلومات بشكل مطبوع. ومن أنواعھا التالي:
•	الطابعة النقطیة
•	طابعة الحبر النفاث
•	الطابعة اللیزریة.
3.	الراسمةPlotter :
یستخدمھا المھندسون لطباعة التصامیم الھندسیة(كالمخططات وتصامیم الطرق).
4.	السماعات.
`,
},
{id: 8,
    ch: 3,
    content: ` البرامج والأوامر التي تشرف على كافة أجزاء الحاسب المادیة Hardware وتمكنھا من العمل،وتقوم بالإشراف على تسلسل تنفیذ عملیات المعالجة:`,
    choices: ["البرمجيات Software ", "المعالج CPU", "وحدات الإخراج Output Devices", "وحدات الادخال Input Devices"],
    answer: 0,
    difficulty : "سهل",
    reason:
      `البرمجيات وتتكون  من الأنواع التالیة:
1.	برامج النظم (نظم التشغیل)System software :
وھي أیضا تسمى نظم التشغیل والتي تتولى التحكم في عمل الحاسب الآلي.
2.	برامج التطبیقات Application software:
وھي البرامج التي تستخدم لإنجاز الأعمال بواسطة الحاسب الآلي .
أمثلة: برامج معالجة النصوص- برامج قواعد البیانات - برامج الجداول الحسابیة.
3.	برامج الشبكات Network software :
وھي البرامج التي تٌمكن مجموعات من الحاسبات لتتصل بعضھا البعض وتتناقل البیانات فیما بینھا.
4.	برامج اللغات Languages software :
وھي لغات البرمجة التي تزود المبرمج بالأدوات اللازمة لكتابة وتحریر برامج الحاسب.
`,
},
{
    id: 9,
    ch: 3,
    content: `عبارة عن شریحة الكترونیة مصنعة من السلیكون التي تحتوي على العدید من الدارات الالكترونیة الموصلة باللوحة الام Motherboard :`,
    choices: ["المعالج", "الطابعة", "الذاكرة", "نظام التشغيل"],
    answer: 0,
    difficulty : "متوسط",
    reason:
      `المعالج: عبارة عن شریحة الكترونیة مصنعة من السلیكون التي تحتوي على العدید من الدارات
      الالكترونیة الموصلة باللوحة الام Motherboard لتقوم باستقبال البیانات (وحدات الادخال)،
      ثم معالجتھا وتخزینھا واخراجھا (وحدات الاخراج) بالإضافة اجراء جمیع العملیات الحسابیة.
یحتوي المعالج على ذاكرة داخلیة تسریعیة تسمى Cache memory ولھا نوعان ھما:
a.	ذاكرة أساسیة: تسمى ذاكرة المستوى الأول وتوضع داخل المعالج.
b.	ذاكرة ثانویة: تسمى ذاكرة المستوى الثاني وتوضع على اللوحة الام.
یتكون المعالج من الاجزاء الرئیسیة التالیة:
a.	وحدة التحكم: التي تتولى التحكم بمسار البیانات داخل المعالج وتنسق العمل بین اجزائه بالإضافة الى التأكد من سلامة التعلیمات من الاخطاء.
b.	وحدة الحساب والمنطق: تتولى اجراء ومعالجة الحسابات الرقمیة والمقارنات، وكذلك حفظھا.
 `,
  },
   {
    id: 10,
    ch: 3,
    content: `من وحدات التخزین الثانویة ويتكون من عدة اقراص معدنیة او بلاستیكیة مقواه توضع فوق بعض ومغطاة بمادة قابلة للمغنطة:`,
    choices: ["محرك الأقراص الصلبة  Hard Disk", "محرك الأقراص الممغنطة Floppy Disk", "محرك الأقراص اللیزریة CD- Rom Driver", "ذاكرة الفلاش Flash Memory"],
    answer: 0,
    difficulty : "متوسط",
    reason:
    `یقسم القرص الى مسارات دائریة Tracks ویتم تقسیم المسار الى قطاعات Sectors
    تتحدد سرعة القرص الصلب وفق التالي:
        • عدد المسارات
        • عدد القطاعات
        • عدد الرموز التي یمكن تخزینھا في القطاع الواحد
        • عدد اوجه القرص
       خصائص القرص الصلب:
        • إمكانیة تخزین ھائلة
        • سرعة وصول عالیة للبیانات ونقلھا
        • إمكانیة تخزین كافة أنواع الملفات
      • إمكانیة الوصول المباشر إلى المعلومات`,
  }, {
    id: 11,
    ch: 3,
    content: `من وحدات التخزین الثانویة و یستخدم لكتابة وقراءة البیانات المخزنة على الاقراص، وھي وسیلة تخزین ذات سعة محددة 1.44MB  ویعیبھا سرعة العطب والتلف للبیانات:`,
    choices: ["محرك الأقراص الصلبة  Hard Disk", "محرك الأقراص الممغنطة Floppy Disk", "محرك الأقراص اللیزریة CD- Rom Driver", "ذاكرة الفلاش Flash Memory"],
    answer: 1,
    difficulty : "متوسط",
    reason:
      `القرص المرن (الممغنط) ھو وسیط لتخزین البیانات، ویتألف من قطعة دائریة رفیعة مرنة، تتم قراءة وكتابة البیانات الى القرص باستخدام سواقة اقراص مرنة. تقاس الاقراص المرنة عادة بوحدة الانش. قل ونّدر استخدامھا في الوقت الحالي.
      تنقسم الى:
        • اقراص مرنة بحجم ٥.٢٥ انش
        • اقراص مرنة بحجم ٣.٥ انش
      `,
  }, {
    id: 12,
    ch: 3,
    content: `من وحدات التخزین الثانویة تمتاز بسعتھا التخزینیة الجیدة وسھولة حملھا:`,
    choices: ["محرك الأقراص الصلبة  Hard Disk", "محرك الأقراص الممغنطة Floppy Disk", "محرك الأقراص اللیزریة CD- Rom Driver", "ذاكرة الفلاش Flash Memory"],
    answer: 3,
    difficulty : "متوسط",
    reason:
      `تعد ذاكرة الفلاش(Flash Memory)  الافضل للتخزین الثانوي كونھا تمتاز بسعتھا التخزینیة الجیدة- سھولة حملھا- قدرتھا على التحمل- وصغرحجمھا وسعرھا الملائم.`,
  },
  {
    id: 13,
    ch: 3,
    content: ` من وحدات التخزین الثانویة و تستخدم لقراءة البیانات الموجودة على الاقراص اللیزریة CDs وھي افضل من الاقراص المرنة من حیث السعة والتحمل ویعیبھا سرعة العطب والتلف للبیانات`,
    choices: ["محرك الأقراص الصلبة  Hard Disk", "محرك الأقراص الممغنطة Floppy Disk", "محرك الأقراص اللیزریة CD- Rom Driver", "ذاكرة الفلاش Flash Memory"],
    answer: 2,
    difficulty : "متوسط",
    reason:
      `القرص اللیزري عبارة عن اقراص دائریة الشكل، مصنوعة من مادة بلاستیكیة قویة ومغطاة بطبقة من الألمنیوم، یتم تشغیلھا عن طریق قارئ الاقراص الذي یستخدم الاشعة اللیزریة لقراءة وتسجیل المعلومات. یمیزھا السعة التخزینیة الكبیرة مقارنة بالأقراص المرنة التي تصل الى ٧٠٠ میجابایت.
ھنالك نوعین من الأقراص المدمجة وھما:
•	القرص CD-R: الذي یستخدم للكتابة مرة واحدة فقط ولا یمكن التعدیل على المعلومات المخزنة.
•	القرص CD-RW  :الذي یستخدم للكتابة وللقراءة عدة مرات مرة ویمكن التعدیل على المعلومات المخزنة.
`,
  },
  {
    id: 14,
    ch: 3,
    content: `تقاس سرعة المعالج ب:`,
    choices: ["ثانية", "بايت", "متر", "هرتز"],
    answer: 3,
    difficulty : "صعب",
    reason:
      `تقاس سرة المعالج بالهرتز Hertz اي عدد الدورات التي ینجزھا المعالج في الثانیة مثال: سرعة معالج 3.66 Gigahertz تدل على ان ھذا المعالج یستطیع القیام ب ٣.٦٦ بلیون عملیة في الثانیة.عدد البتات: تقاس قدرة المعالج بالبت أي عدد المسارات المستخدمة لكل دورة، ویوجد الانواع المتوفر التالیة ٣٢ بت و ٦٤ بت وكذلك ١٢٨ في الوقت الحاضر.`,
  },
]

export const ch4 = [
  {
    id: 1,
    ch: 4,
    content: `مجموعة من أجھزة الكمبیوتر والأجھزة المحیطیة Peripherals التي تتصل ببعضھا، وتتیح لمستخدمیھا أن یتشاركوا الموارد Resources والبرامج Programs وكذلك البیانات Data فیما بینھما:`,
    choices: ["شبكة الحاسب", "التواصل الاجتماعي", "شبكة الاتصالات", "البرتوكولات"],
    answer: 0,
    difficulty : "سهل",
    reason:
      `لعمل شبكة حاسب یجب أن لا یقلّ الحد الأدنى لمكونات شبكة الحاسب الآلي عن:
      • مجموعة من أجھزة الحاسب الآلي (جھازي كمبیوتر على الأقل).
      • بطاقة شبكة Network Interface Card (NIC) والتي تشكل جسر الاتصال بین الكمبیوتر وأسلاك النقل التي تربط مكونات الشبكة.
      • وسط ناقل (Transmission Media) للاتصال بین عناصر الشبكة مثل الكابلات Cables أو الأمواج القصیرة Radio Waves والألیاف الضوئیة Fiber Optic
      • نظام تشغیل شبكي Network Operating System (NOS) یقدم خدمة تنظیم صلاحیات وحقوق المستخدمینRights And Permissions  والأجھزة المشتركة على الشبكة في الوصول إلى الموارد.`,
  },  {
    id: 2,
    ch: 4,
    content: `عبارة عن مجموعة من الأجھزة المختلفة والموزعة جغرافیا في أنحاء العالم والمرتبطة فیما بینھا وتتناقل البیانات عبر وسائل
    الاتصالات المختلفة:`,
    choices: ["الناقل", "المرسل", "الانترنت", "الموزع"],
    answer: 2,
    difficulty : "سهل",
    reason:
      `يقدم الانترنت العديد من الخدمات مثل:
      • خدمة نقل الملفات FTP : یعرف البروتوكول File Transfer Protocol FTP بأنه بروتوكول لنقل الملفات على الانترنت من موقع لآخر.
      • خدمة التعامل عن بعد Telnet: یوصف ھذا البروتوكول طریقة النفاذ عن بعد Remote Login حیث یسمح لمستخدم حاسب (زبون) بأن یتصل مع حاسب بعید (خادم) ویتصرف كأنه یعمل مباشرة على الحاسب البعید.
      • خدمة البرید الالكتروني Email : تعتبر خدمة البرید الالكتروني الخدمة الأكثر انتشارا واستخداما على الانترنت.`,
  }, {
    id: 3,
    ch: 4,
    content: `البرنامج الذي یسمح بالبحث ضمن الوثائق (صفحات ویب –
      صور – ملفات) الموجودة على مواقع الویب:`,
    choices: ["محرر النصوص", "المتصفح", "محرك البحث", "قاعدة البيانات"],
    answer: 2,
    difficulty : "سهل",
    reason:
    `1.	المحركات العامة: ھي المحركات التي تبحث في جمیع وثائق الویب التي تفھرسھا وأشھرھا: Google وYahoo
2.	المحركات البینیة: ھي المحركات التي توجه بحثھا إلى مجموعة مختارة من محركات البحث العامة وأشھرھا: Met Crawler وStarting Point
3.	المحركات المتخصصة وتشمل:
•	محركات البحث عن الوسائط المتعددة.
•	محركات البحث عن الأخبار.
•	یضاف إلیھا المحركات الخاصة بموقع معین إذ نجد في العدید من المواقع الضخمة محرك بحث عن الوثائق الموجودة في ھذا الموقع فقط، مثل: موقع ...BBC، CNN الخ.
`
      ,
  }, {
    id: 4,
    ch: 4,
    content: `نظام معلومات موزع ومتعدد الوسائط، الموجود على ملایین أجھزة الكمبیوتر ویمكن الوصول إلیه عن طریق الانترنت:`,
    choices: ["الويب", "الانترنت", "الخادم", "محرك البحث"],
    answer: 0,
    difficulty : "سهل",
    reason:
      `الویب ھو الاسم الشائع لشبكة الویب العالمیة (World Wide Web- WWW)
      مالفرق بین الانترنت والویب؟
      الانترنت: ھي الشبكة العالمیة من أجھزة وشبكات وبروتوكولات وسیرفرات و بنى تحتیة للاتصالات وما إلى ذلك.
      الویب: صفحة على الشبكة على أحد السیرفرات (الخوادم) یمكن لكل من ھو متصل بالانترنت الوصول لتلك الصفحة، ومشاھدتھا.
      كیف یعمل الویب؟
یعمل الویب وفق بنیة خادم / زبون (Client / Server)
على ماذا یستند الویب؟
یستند الویب على معیارین أساسیین ھما:
•	بروتوكول نقل النص التشعبي (Hypertext Transfer Protocol) HTTP: وھو یھتم بأمور شبكة الاتصال حتى یؤمن التواصل بین الخادم والزبون (المستخدم) عبرالشبكة.
•	لغة تأشیر النصوص الفائقة (Hypertext Markup Language) HTML: وھي تسمح بتوصیف الوثائق، وخصوصا الوثائق النصیة ، لكن یمكن أیضا أن توصف الوسائط الأخرى كالصوت والصور والفیدیو.
`,
  }, {
    id: 5,
    ch: 4,
    content: `عند كتابة عناوین مواقع الویب تتكوَّن العناوین من أحرف لغویة احدها تُبیِّن مجال عمل الجھة صاحبة الموقع مثلاً edu  تعني:`,
    choices: ["نشاط حكومي", "نشاط تجاري", "نشاط تعلیمي", "نشاط عسكري"],
    answer: 2,
    difficulty : "سهل",
    reason:
      `طریقة كتابة عناوین مواقع الویب: تتكوَّن العناوین من أحرف لغویة قد تدخل بینھا الأرقام.
      مثال www.kku.edu.sa :
      أما عن تفصیل العنوان المكتوب بأحرف لغویة فھو كما یلي:
      www تعني أن الموقع مبنيّ وفق معاییر الویب.
      kku ھو اسم الجھة صاحبة الموقع (المستضیف).
      edu تُبیِّن مجال عمل الجھة صاحبة الموقع.
      من مجالات عمل الجهه صاحبة الموقع:
edu : نشاط تعلیمي
gov : نشاط حكومي
com : نشاط تجاري
mil : نشاط عسكري
net: شركة أو مؤسسة
org: نشاط منظمة
`,
  },
  {
    id: 6,
    ch: 4,
    content: `تدعى الحواسیب المرتبطة ببعضھا في منطقة جغرافیة واحدة مثل مبنى:`,
    choices: ["الشبكة المدنية MAN (Metropolitan Area Network)", "الشبكة المحلية LAN (Local Area Network) ","الشبكة العالمية GAN (Global Area Network) ",  "الشبكة الموسعة WAN (Wide Area Network)"],
    answer: 1,
    difficulty : "متوسط",
    reason:
      `تصنف شبكات الحاسب بناء على عدة خصائص منھا:
      تصنیف الشبكات بنا ء على التوزیع الجغرافي (Geographical Distribution)
          • الشبكة المحلیة :LAN (Local Area Network )
      تدعى الحواسیب المرتبطة ببعضھا في منطقة جغرافیة واحدة بشبكة منطقة محلیة، أو شبكة محلیة اختصاراً LAN تعود ملكیة ھذه الشبكات عادة إلى شركة أو مؤسسة واحدة، تكون مكاتبھا في نفس الموقع أو المبنى.
          • الشبكة الموسعة WAN (Wide Area Network):
      شبكة تمتد في منطقة جغرافیة كبیرة جداً قد تشمل جمیع الأقطار وتصل للعالم كله، ترتبط فیھا العدید من الشبكات بواسطة البنیة التحتیة لشركات الاتصالات وتوفر ھذه الشبكة العدید من الخدمات للمستخدمین مثل شبكة الانترنت.
          • الشبكة المدنیة MAN (Metropolitan Area Network Metropolitan):
      ھي عبارة عن شبكات تمتد على مساحة مدینة لتصل بین عدة شبكات محلیة صغیرة مستخدمة نفس تقنیات الشبكة الموسعة.
      ايضاً تصنف شبكات الحاسب بناء على علاقة الأنظمة ببعضھا:
•	شبكة الند للند (الشبكات المتكافئة) Peer-to-Peer:
وھي شبكة تكون فیھا جمیع الأجھزة متساویة القدرات بحیث لا یتحكم احد الأجھزة بالأجھزة الأخرى، ویمكن لاى جھاز آن یطلب ملفات وبرامج أو استخدام مصادر من الأجھزة الأخرى، حیث تكون موزعة البرامج والملفات على جمیع الأجھزة بالتساوي وتعمل الأجھزة معا لانجاز الأعمال. تستخدم في الشبكات الصغیرة التي تحتوي على عشرة أجھزة أو اقل، وفي الشبكات التي لا تحتاج إلى درجة عالیة من السریة على معلوماتھا مثل الشبكة البیتیة.
•	شبكة الخادم/العمیل (Client/Server):
تتركز في ھذه الشبكة خدمة أو أكثر تقوم بھا الخوادم وتكون بمواصفات خاصة لتوزیع الخدمات المطلوبة على أجھزة العملاء التي تطلب الخدمة.
`,
  }, {
    id: 7,
    ch: 4,
    content: `الأجھزة توصل على شكل دائري حيث تسیر البیانات في اتجاه واحد من جھاز لآخر، میزة ھذه التقنیة أن كل جھاز یعتبر مكرر Repeater وهو جھاز لتقویة إشارات الشبكة لتتمكن من السفر لمسافات بعیدة. كما أنھا تنقل حجم كبیر من البیانات،
    أما عیبھا أن جھاز واحد فقط یرسل البیانات في وقت محدد.`,
    choices: ["شبكة ذات بنیة نجمیة Star Topology", "شبكة ذات بنیة حلقیة Ring Topology", "شبكات ذات بنية معشقة Mesh Topology" , "شبكة ذات بنیة خطیة Bus Topology"],
    answer: 1,
    difficulty : "متوسط",
    reason:
      `البنیة الطبوغرافیة Topologies هي عملیة تنظیم الكمبیوترات والكیابل على الشبكة، یجري تنظیم الشبكات وفق بعض الأشكال القیاسیة التي تعتمد تسمیتھا وطریقة عملھا على طریق توزیع الأجھزة المتصلة بالشبكة – مكانیا –بالنسبة لبعضھا البعض.
      بالإضافة الى شبكة ذات بنیة حلقیة Ring Topology یمكن للشبكة أن تتشكل حسب بعض الأشكال القیاسیة التالیة:
•	شبكة ذات بنیة خطیة Bus Topology: یمكن تشبيه أسلوب البنیة الخطیة لشبكة ما بطریق سریع یصل بین عدة مدن، حیث یمكن لوسائل النقل أن تعبر ھذا الطریق بین أي مدینتین. كل الأجھزة توصل في شكل خط مستقیم على الشبكة ویجب إغلاق بدایة الشبكة ونھایتھا بما یسمى القافل Terminator. یمكن تبادل البیانات على الوسط الناقل بالاتجاھین بین أي عقدتین (جھازین) على الشبكة، إلا أن انقطاع أي عقدة یؤدي إلى توقف الشبكة عن العمل. تمتاز ھذه البنیة بسھولتھا ولكنھا تصبح سیئة الأداء مع ازدیاد عدد العقد المتصلة بالشبكة.
•	شبكة ذات بنیة نجمیه Star Topology: تتألف ھذه البنیة من عقدة مركزیة تدعى مجمع Hub أو مبدل Switch حیث یتم وصل الحواسیب إلى ھذه العقدة باستخدام الكابلات. تتم جمیع عملیات استقبال أو إرسال البیانات من وإلى الأجھزة عن طریق ھذه العقدة (مجمع أو مبدل). تتمیز ھذه البنیة في كونھا سھلة التركیب. كما تتمیز بمرونتھا وإمكانیة توسعھا دون التأثیر على الشبكة. تتمیز أیضا بان العطل الذي یطرأ على أحد الأجھزة لا یؤثر على أداء الشبكة، أما عبیھا لو تعطل ال Hub توقفت جمیع أجھزة الشبكة.
`,
  },{
    id: 8,
    ch: 4,
    content: `ھي مفھوم ناشئ یصف إجراءات البیع والشراء أو تبادل المنتجات والخدمات والمعلومات بواسطة شبكات الحاسب بما فیھا شبكة الانترنت:`,
    choices: ["التداول", "التجارة الإلكترونية", "التبادل التجاري", "الخدمات التجارية"],
    answer: 1,
    difficulty : "متوسط",
    reason:
      `لا یشیر مصطلح التجارة الالكترونیة إلى عملیات البیع والشراء فحسب، بل یشیر أیضا إلى خدمات المستھلكین و التعاون مع شركاء العمل و توجیه المناقلات الإلكترونية داخل الشركات و كل ما یتعلق بدورة الزمن الدائمة، والسرعة، والعالمية، والإنتاجية المحسنة، والوصول إلى المستھلكین الجدد، وبتشارك المعرفة من خلال الھیئات من أجل مزایا التنافسیة.
      تستخدم التجارة الالكترونیة تقنیات عدة تتراوح من التبادل الالكتروني للمعطیات (EDI - Electronic Data Interchange) إلى البرید الالكتروني (E-mail).
تشمل البنیة التحتیة للتجارة الالكترونیة ما یلي:
•	الخدمات والأعمال العامة (البطاقة الذكیة للدفع الالكتروني، التوثیق...).
•	تبادل الرسائل وتوزيع المعلومات EDI)، E-mail).
•	المحتوى متعدد الوسائط والنشر على الشبكة.
•	الشبكة (الاتصالات السلكية واللاسلكية، الانترنت)
`,
  }, {
    id: 9,
    ch: 4,
    content: `تسعى إلى تطویر نمط التجارة الذي تعتمده عبر مزج طرقھا التقلیدیة في العمل بأسالیب جدیدة:`,
    choices: ["شركات تجارية تقليدية", "شركات تجارة الكترونیة", "الخدمات التجارية", "شركات التداول"],
    answer: 1,
    difficulty : "متوسط",
    reason:
      `یمكن تقسیم الشركات في عصرنا الحالي إلى نوعین:
      1. شركات تجاریة تقلیدیة
  وھي شركات تجارة تقلیدیة ممزوجة بتجارة إلكترونیة.تسعى إلى تطویر نمط التجارة الذي تعتمده عبر مزج طرقھا التقلیدیة في العمل بأسالیب جدیدة مستنبطة من مفاھیم التجارة الالكترونیة والاعتماد على خدمات الانترنت في مراحل مفصلیة من العملیة:
     • التواصل مع المزودین للحصول على عروض الأسعار وعلى عروض الخدمات.
     • تنفیذ جزء ھام من العملیة التسویقیة سواء كان الزبون فردا أم مؤسسة وسواء كان التواصل عبر البرید الالكتروني أو موقع الویب.
     • تنفیذ عملیات بیع لمنتجاتھا عبر الانترنت والوصول مباشرة إلى زبائنھا دون وسیط.
      2. شركات تجارة الكترونیة
      وھي شركات تجارة تعتمد مبدأ التجارة الالكترونیة الكامل أو ما یعرف بـ E-Company
المثال الحي على ھذا النوع ھو أمازون Amazon التي تنفذ العملیة التجاریة كاملة بدءا من التواصل التسویقي من المزودین (مكتبات وشركات توزیع وغیرھا)، مرورا بالعملية التسويقية (برید إلكتروني، موقع ویب تفصیلي) وانتھاءً بالبیع عبر الموقع دون الحاجة لوجود مراكز بیع فیزیائیة.`,
  },  {
    id: 10,
    ch: 4,
    content: `أحد أنواع التجارة الإلكترونية ومعظم التجارة الالكترونیة الیوم ھي من ھذا النمط، وھي تتضمن مناقلات السوق الالكترونیة بین الشركات:`,
    choices: ["شركة لمستھلك B2C (Business to Consumer)", "شركة لشركة B2B (Business to Business)", "مستھلك لمستھلك C2C (Consumer to Consumer)"],
    answer: 1,
    difficulty : "متوسط",
    reason:
      `أيضا من أنواع التجارة الالكترونیة:
•	مستھلك لمستھلك C2C (Consumer to Consumer)
البیع بالتجزئة لمتسوقین مستقلین. فالمتسوق النموذجي على موقع الأمازون (amazon.com) ھو مستھلك أو زبون.
•	شركة لمستھلك B2C (Business to Consumer)
في ھذا النوع یقوم المستھلك بالبیع مباشرة لمستھلكین آخرین. ومن الأمثلة على ذلك عندما یقوم الأفراد بالبیع عبر الدعایات المبوبة، أو بیع أثاث منزلي أو سیارات وھكذا.
`,
  },
  {
    id: 11,
    ch: 4,
    content: `یعتمد على فكرة تجمیع كافة الأنشطة والخدمات المعلوماتیة التفاعلیة والتبادلیة في موضع واحد ھو موقع الحكومة الرسمي على شبكة الانترنت وتقدیم خدماتھا للجمھور في تحسین نشاط المؤسسة وتخفیض تكلفة الأداء:`,
    choices: ["الشبكة الحكومية", "الخدمات الالكترونية", "التجارة الالكترونیة", "الحكومة الالكترونیة"],
    answer: 3,
    difficulty : "متوسط",
    reason:
      `أھداف برنامج الحكومة الإلكترونیة:
•	تقدیم الخدمات إلى المتعاملین في مكان وجودھم بالشكل والأسلوب المناسبین وبالسرعة والكفاءة المطلوبة مع تطویر أفضل الطرق لمشاركتھم في العملیة التنفیذیة.
•	توفیر مناخ مشجع للمستثمرین وتذلیل العقبات التي یواجھونھا والتي تتمثل بشكل أساسي في بطء الإجراءات وتعقیدھا، مما سینعكس بشكل إیجابي على تشجیع الاستثمار المحلي وجذب المزید من الاستثمارات الأجنبیة.
•	توفیر معلومة دقیقة محدثة لمتخذ القرار وذلك للمعاونة في التخطیط طویل المدى للمشروعات التنمویة، ومتابعة التنفیذ بشكل دقیق.
•	رفع كفاءة أعمال الجھاز الحكومي وأسلوب المراقبة والمتابعة.
•	تقنین الإنفاق الحكومي عن طریق الاستخدام الأمثل للموارد واستحداث آلیات جدیدة للمشتریات الحكومیة وإدارة المخزون ومتابعة تنفیذ الموازنة.
•	تھیئة الجھاز الحكومي للاندماج في النظام العالمي وذلك حتى تلتزم الحكومة باستیفاء ما علیھا من اتفاقیات شراكة دولیة والتي تتطلب مستوى أداء یتواكب مع النظم الحدیثة المتبعة في أماكن أخرى.`,
  } ,
  {
    id: 12,
    ch: 4,
    content: `من متطلبات بناء الحكومة الالكترونیة:`,
    choices: ["عدم وجود أمن المعلومات", "توفر أنظمة غير مناسبة", "توفر بیئة سیاسیة مناسبة", "وجود بيئة تنظیمیة غيرمناسبة."],
    answer: 2,
    difficulty : "متوسط",
    reason:
      `من متطلبات بناء الحكومة الالكترونیة:
    • توفر اقتصاد قوي.
    • توفر بیئة سیاسیة وتنظیمیة مناسبة.
    • توفر بنیة تحتیة متینة ومتطورة.
    • وجود نسبة عالیة لمستخدمي الانترنت من ذوي الدخل المحدود.
    • وجود الأنظمة والتشریعات المناسبة.
    • معرفة سیر المعاملات الحكومیة.
  • توفر القدر الكافي من أمن المعلومات وبناء القدرات والطاقات البشریة.`,
  } ,
]

export const ch5 = [
  {
    id: 1,
    ch: 5,
    content: `ھو أول برنامج تشاھده عند تشغیل جھازك وآخر برنامج تشاھده عند إغلاق جھازك ووظيفته إدارة الذاكرة، المكونات المادیة، الملفات و المعالج:`,
    choices: ["برنامج تحرير النصوص", "برنامج الكشف عن الفيروسات", "برنامج التحكم", "نظام التشغيل"],
    answer: 3,
    difficulty : "متوسط",
    reason:
      `یعرف نظام التشغیل بأنه برنامج یدیر عتادیات الحاسب (المكونات الصلبة) فھو یوفر البرمجیات الضروریة لتشغیل ھذه العتادیات ویعمل كوسیط بین المستخدم والحاسب حیث یسمح للمستخدم باستعمال الحاسب وتطبیقاته المختلفة.
      و تصنف أنظمة تشغیل الحاسب بحسب طریقة التعامل مع المستخدم إلى نوعین :
         • نظم تشغیل ذات بیئة كتابیة Command-Line
      تستخدم البیئة الكتابیة بمعنى أن المستخدم یتعامل ویتفاعل مع الحاسب الآلي عن طریق إعطاء الأوامروالتعلیمات بشكل كتابي ، وھذا یعني أن المستخدم یعطي كل أمر للحاسب بشكل مكتوب وبطریقة منطقیة یفھمھا الحاسب الآلي ، مثال نظام تشغیل DOS.
         • نظم تشغیل ذات بیئة رسومیة Graphical
      ھذا النوع من أنواع نظام التشغیل یستخدم الأشكال الرسومیة ، ویتفاعل المستخدم مع ھذا النوع عن طریق الفأرة Mouse فكل ضغطة لزر الفأرة تمثل أمراً للحاسب الآلي ، وھذا النوع ھو الأكثر شیوعا والأسھل استخدام مثال نظام تشغیل windows، وماكنتوش.`,
  }, {
    id: 2,
    ch: 5,
    content: `يتكون نظام التشغيل من عدة أجزاء حيث الجزء الذي یرتبط بالمستخدم والتطبیقات يسمى:`,
    choices: ["نظام ادارة الملفات", "واجهة المستخدم ", "نظام إدارة المعالج", "نظام إدارة الذاكرة"],
    answer: 1,
    difficulty : "متوسط",
    reason:
      `یتألف نظام التشغیل بشكل مبسط من:
      a. واجھة الأوامر User Interface:
   وھو الجزء الذي یرتبط بالمستخدم والتطبیقات، حیث یقدم للمستخدم واجھة أوامر نصیة، أو واجھة أوامر رسومیة (قوائم وأیقونات) للتعامل مع نظام التشغیل. یقوم المستخدم من خلال واجھة الأوامر بطلب تنفیذ الأوامر والعملیات التي یریدھا.
      b. النواة Kernel
  وھو الجزء الأساسي في نظام التشغیل. یربط ھذا الجزء بین مفسر الأوامر وبین المكونات المادیة، حیث یحوي إجراءات وبرامج النظام الأساسیة التي تتعامل مع المكونات الصلبة وتتحكم بھا.
  بالإضافة إلى المكونات الأخرى مثل نظام إدارة المعالج ونظام إدارة الذاكرة ونظام إدارة الملفات وغیرھا والتي تدیرھا النواة مباشرة.
  `,
  }, {
    id: 3,
    ch: 5,
    content: `مجموعة من البیانات المرتبطة ببعضھا البعض مخزنة ومنظمة بأسلوب یسمح باستخلاص المعلومات التي نحتاجھا بسھولة:`,
    choices: ["نظام التشغيل", "قاعدة البيانات", "الشبكة", "واجهة المستخدم"],
    answer: 1,
    difficulty : "متوسط",
    reason:
      `قاعدة البيانات Database ھي مجموعة من عناصر البیانات المنطقیة المرتبطة مع بعضھا البعض بعلاقة ریاضیة، وتتكون قاعدة البیانات من جدول واحد أو أكثر من جدول. ویتكون الجدول من سجل (Record) أو أكثر من سجل ویتكون السجل من حقل أو أكثر من حقل (Field).
      مثال على السجل: السجل الخاص بموظف معین یتكون من عدة حقول مثل رقم الموظف- اسم الموظف - درجة الموظف - تاریخ التعیین - الراتب - والقسم التابع له..الخ`,
  }, {
    id: 4,
    ch: 5,
    content: `يعد أوراكل (Oracle) مثال على:`,
    choices: ["نظام التشغيل", "نظام إدارة قاعدة البیانات", "محرر نصوص", "برنامج تحرير الرسوم"],
    answer: 1,
    difficulty : "متوسط",
    reason:
      `نظام إدارة قاعدة البیانات Database Management System (DBMS)
      ھو البرنامج الذي یتم من خلاله استرجاع البیانات، أو الإضافة أو التعدیل علیھا، أو حذفھا، حیث یقوم البرنامج بالربط بین المستخدم وبین محرك قاعدة البیانات، لأداء تلك المھمة.
      من الأمثلة على نظم إدارة قاعدة البیانات :
        • أكسس (Access)
        • أوراكل (Oracle)
      تتألف قاعدة البیانات عادة من مجموعة من الجداول یحتوي كل منھا على مجموعة من السجلات و الحقول، في حین یتألف نظام إدارة قاعدة البیانات من تجمع من البیانات المرتبطة فیما بینھا ومجموعة من البرامج التي توفر الوصول إلى ھذه البیانات.`,
  }
]

export const ch6 = [
  {
    id: 1,
    ch: 6,
    content: `برامج تتم كتابتھا بغرض إلحاق الضرر بحاسب آخر، أو السیطرة علیه، وتتم كتابتھا بطریقة معینة:`,
    choices: ["نظم التشغيل", "برامج تحرير النصوص", "الفيروسات", "برامج الألعاب"],
    answer: 2,
    difficulty : "سهل",
    reason:
      `الفیروس:
      ھو برنامج حاسوبي یتطفل على برنامج آخر یسمى المضیف (الحاضن)، یقوم بعملیة التكاثر لمھاجمة برامج جدیدة ویكون مصمماً ومبرمجاً لمھاجمة برامج محددة معروفة وكثیرة الاستخدام.
      یتمتع الفیروس بعدة مواصفات:
       • الفیروس برنامج ضیف یتطفل على برنامج آخر یسمى المضیف (الحاضن).
       • یقوم بعملیة التكاثر لمھاجمة برامج جدیدة كما یستطیع تكرار نفسه في ذاكرة الحاسوب.
       • تتراوح خطورته من المتوسط عبر إبطاء الحاسوب أو تخریب بعض الملفات، إلى المدمرة عبر تعطیل نظام التشغیل.
       • یكون مصمما ومبرمجا لمھاجمة برامج محددة معروفة وكثیرة الاستخدام.
       • یعدل البیانات الخاصة بالبرامج والملفات التي یھاجمھا.
       • یصیب الھدف مرة واحدة ویحتفظ بتوقیعه داخل بیانات الھدف مما یساعده في استذكار مھاجمته له.
       • قابل للتغییر والتبدل في بعض الحالات لمنع اكتشافه.
     • یترك البرامج المصابة تعمل على نحو مقبول لفترة من الزمن.`,
  },
  {
    id: 2,
    ch: 6,
    content: `يمتلك الدخیل عادةً حساب مدیر نظام على الحاسوب المستخدم كمنصة لعمله:`,
    choices: ["الحارس", "المشرف", "المتنصت", "المراقب"],
    answer: 2,
    difficulty : "سهل",
    reason:
      `كما ھو الحال في الشبكات الھاتفیة، یمكن ضمن الشبكة الداخلیة القیام بعملیة تنصت على الاتصالات التي تتم بین مختلف عقد الشبكة للحصول على المعلومات المتبادلة. یمتلك الدخیل المتنصت عادةً حساب مدیر نظام على الحاسوب المستخدم كمنصة تنصت. یحتاج ھذا النوع من الاختراقات إلى التحكم المُسبق بأحد حواسیب الشبكة إذ یحتاج المتنصت إلى امتلاك حساب مدیر نظام.
      یمكن مقاومة التنصت بإتباع قواعد بسیطة وضروریة:
        • استخدام كلمات سر متینة وغیر قابلة للكسر أو التوقع وعدم إعطائھا لأي كان.
        • الإقلال قدر المستطاع من السماح لأجھزة محمولة من الاتصال بالشبكة ومنع المستخدمین العادیین من استخدام الأجھزة المتصلة بالشبكة كمدراء نظام.
        • عدم فتح الملفات المرفقة مع الرسائل الإلكترونیة قبل التأكد من مصدرھا ودون مسحھا بمضاد الفیروسات أولاً.
        • استخدام المبدلات (Switches) عوضاً عن المجمعات (Hubs)
        • استخدام بروتوكولات وخدمات شبكیة مشفرة لتأمین الاتصال الشبكي مثل: .IPSecure, Secure FTP, HTTPs
      `,
  },
  {
    id: 3,
    ch: 6,
    content: `علم یختص بأسالیب إخفاء المعلومات يسمى:`,
    choices: ["التشفير (Cryptography)","التقطيع (Hashing)", "التوقيع (Signature)","التهكير Hacking"],
    answer: 0,
    difficulty : "متوسط",
    reason:
    `تكمن جذور التشفیر في الحاجة إلى تأمین التواصل بین طرفین مختلفین إما:
     • لضمان عدم تنصت طرف ثالث على الاتصال عند الحاجة لتبادل معلومات سریة.
     • أو لضمان عدم تعدیل طرف ثالث لمحتوى الرسائل المتبادلة عند الحاجة لتبادل معلومات دون أخطاء.
     • أو لضمان عدم ادعاء طرف ثالث بأنه الطرف الموثوق عند الحاجة للتأكد من وثوقیة مصدرالمعلومات.
     • أو لجمیع ما سبق.
  Crypto-analysis یختص بأسالیب التعرف على المعلومات المخفیة.
  `,
  },
  {
    id: 4,
    ch: 6,
    content: `عملية التشفير تتكون من عدة عناصر احدها یعتبر العنصر السري الأساسي الذي تعتمد عليه أسالیب التشفیر الحدیثة ، وتشبه العملیة بشكل عام أسلوب إغلاق أو فتح القسم
    بالذات:`,
    choices: ["البيانات", "المفتاح", "خوارزمية التشفير", "التوقيع"],
    answer: 1,
    difficulty : "متوسط",
    reason:
      `تتكون عملية التشفير أيضا من:
     • البیانات: تعتبر البیانات الشكل الخادم للمعلومات التي سیجري تبادلھا بین مستخدمي النظام وبما أن ھذه البیانات مرمزة بطرق معروفة وموحدة یمكن في حال وقوعھا في ید طرف آخر أن یكتشف من خلالھا المعلومات التي یجري تبادلھا.
     • خوارزمیات التشفیر: یجري تحویل حروف الرسالة التي نرید تشفیرھا إلى أرقام، لكل حرف رقم مقابل.
     • بیانات مشفرة: تتم تعمیة ھذه البیانات وتشویشھا باستخدام آلیات التشفیر وأدواته بھدف الحصول على بیانات مشوشة یصعب فھمھا ندعوھا البیانات المشفرة.
  `,
  },
  {
    id: 5,
    ch: 6,
    content: `متى نشك بوجود فیروس؟`,
    choices: ["سرعة الحاسوب بما یتناسب مع إمكانیاته.", "امتلاء القرص بما یتناسب مع عدد وحجم الملفات الموجودة علیه.", "ظھور مربعات حوار غریبة أثناء العمل على الحاسوب.", "ظهور نافذة عند اغلاق ملف."],
    answer: 2,
    difficulty : "متوسط",
    reason:
      `نشك بوجود فیروس في الحالات التالیة (على سبیل المثال لا الحصر):
     • بطء الحاسوب بما لا یتناسب مع إمكانیاته ومع عدد البرامج التي تعمل في نفس الوقت.
     • امتلاء القرص بما لا یتناسب مع عدد وحجم الملفات الموجودة علیه.
     • ظھور مربعات حوار غریبة أثناء العمل على الحاسوب أو ظھور ملفات مخربة وغیر مفھومة المحتوى عند فتحھا.
   • إضاءة لمبة القرص الصلب أو القرص المرن بشكل مستمر، دون أن تقوم بعملية فتح أو حفظ ملف.`,
  },
   {
    id: 6,
    ch: 6,
    content: `من القواعد الوقائیة من الفیروسات:`,
    choices: ["عدم تنفیذ عملیات النسخ الاحتیاطي الدوري للملفات.", "حمایة الحاسوب بوضع مضادات الفیروسات عليه.", "تنصیب أي برنامج على الحاسوب دون التحقق من مصدره.", "فتح الملفات المرفقة مع الرسائل الإلكترونیة دائماً."],
    answer: 1,
    difficulty : "متوسط",
    reason:
    `
      للوقاية من الفيروسات:
•	تنفیذ عملیات النسخ الاحتیاطي الدوري للملفات.
•	حمایة الحاسوب بوضع مضادات الفیروسات علیه وتحدیث معلوماتھا باستمرار عبر تنصیب نسخھا الحدیثة أو تحدیثھا.
•	تحدید مستوى أمان متصفح الإنترنت بأفضل شكل ممكن.
•	عدم السماح بتنصیب أي برنامج على الحاسوب دون التحقق من موثوقیة مصدره.
•	عدم فتح الملفات المرفقة مع الرسائل الإلكترونیة قبل التأكد من مصدرھا ودون فحصھا بمضاد الفیروسات.
•	فحص الأقراص المتنقلة بشكل دائم قبل استخدامھا.
•	استخدام خاصیة فحص الفیروسات المدمجة مع ال BIOS لفحص فیروسات الإقلاع.
كما يجب على المؤوسسات:
•	منع المستخدمین من تنصیب برامج غیر مرخصة من قبل المؤسسة التي یعملون بھا على حواسیب المؤسسة.
•	وضع إستراتیجیة لمكافحة الفیروسات ضمن المؤسسة.
•	فرض عقوبات على كل من یخالف تطبیق ھذه الإستراتیجیة.
•	تشكیل فریق خاص بأمن المعلومات ضمن المؤسسة تكون إحدى مھامه مكافحة الفیروسات.
      `,
  },
  {
    id: 7,
    ch: 6,
    content: `الفیروس برنامج حاسوبي مؤلف من برامج جزئیة مرتبطة ببعضھا البعض أحدها هو البرنامج المسؤول عن نسخ الفیروس في الذاكرة أو نسخه عبر الشبكة أو ربطه بملفات أو برامج جدیدة لمھاجمتھا:`,
    choices: ["برنامج الحماية (Protector)", "برنامج التكاثر (Replicator)", "برنامج التحفيز(Trigger)", "برنامج الحمل  (Payload)"],
    answer: 1,
    difficulty : "صعب",
    reason:
      `بالإضافة الى:
      • برنامج الحمایة (Protector): ھو البرنامج المسؤول عن حمایة الفیروس من الكشف عن طریق تشفیر ملفاته الملحقة وتشفیر مكوناته.
      • برنامج التحفیز (Trigger) :ھو البرنامج المسؤول عن انتظار الحدث الذي یبدأ اعتباراً منه الفیروس بالعمل. یمكن للحدث أن یكون تاریخاً محدداً أو عملیة إقلاع لبرنامج أو خدمة ضمن الحاسوب، حیث یعطي المحفز عندھا الإشارة لبرنامج Payload لتنفیذ عمله.
      • الحِمل (التنفیذ) (Payload): ھو البرنامج الذي ینفذ المھمة الموكلة للفیروس والتي غالباً ما تكون مؤذیة وتخریبیة فتتسبب في تعطیل الملفات التنفیذیة (البرامج) بحیث تتوقف عن العمل، أو تتسبب في تخریب محتوى النصوص بحیث تصبح الملفات النصیة مشوشة أو ناقصة أو غیر قابلة للفتح من قبل محرر النصوص.`,
  }, {
    id: 8,
    ch: 6,
    content: `للفیروسات أشكال متعددة احدها عبارة عن برامج كمبیوتر تبدو كأنھا برامج مفیدة، ولكنھا على عكس ذلك تھدد أمان الكمبیوتر وتسبب الكثیر من الأضرار:`,
    choices: ["الديدان (Worms)", "حصان الطروادة (Trojan)", "الفیروسات المحلیة (Local Viruses)", "الفیروسات الشبكية (Network Viruses)"],
    answer: 1,
    difficulty : "صعب",
    reason:
      `بالإضافة الى:
    • الفیروسات المحلیة (Local Viruses): تصیب برامج وملفات وقطاعات حاسوب واحد فتدمرھا أو تخربھا.
    • الفیروسات الشبكیة (Network Viruses): ھي الفیروسات التي تملك إمكانیة التعرف على القنوات الشبكیة المفتوحة بین حواسیب الشبكة الواحدة، والتي تستطیع نسخ نفسھا عبر ھذه القنوات لإصابة بقیة الحواسیب الموجودة والعاملة على نفس الشبكة.
    • الديدان (Worms): ھي الفیروسات التي تصیب الحواسیب وتمتلك قدرة الفیروسات الشبكیة المساعدة في الانتقال ضمن الشبكة، لكن الدیدان لا تقوم بمھاجمة ملفات أو برامج أو قطاعات في القرص الصلب لتخریبھا، بل تھاجم عادة الذواكر والقرص الصلب وتنسخ نفسھا آلاف المرات في الثانیة الواحدة بحیث تعمل على استھلاك موارد الجھاز.
    • فیروسات متعددة المھام Multipartite Viruses)): تمتلك إمكانیات الفیروسات السابقة جمیعھا وتكون مدمرة في كثیر من الأحیان.`,
  },  {
    id: 9,
    ch: 6,
    content: `یستخدم علم التشفیر الآلیه التالیة للتحقق من مصدرالمعلومات:`,
    choices: ["التقطيع (Hashing)", "التوقيع (Signature)", "التشفير (Encryption)", "التهكير (Hacking)"],
    answer: 1,
    difficulty : "صعب",
    reason:
      `تسمح عملیة التوقیع الالكتروني بالتحقق من مصدر المعلومة عبر إرفاق الرسالة ببیانات خاصة بمرسل الرسالة وتقطیع النص الناتج من أجل حساب الطبعة، یجري بعدھا تشفیر الطبعة وإرفاقھا بالرسالة.
      أيضا یستخدم علم التشفیر الآلیات التالیة لضمان تحقیق اهدافة:
        • التقطيع (Hashing): للتأكد من صحة المعلومات.
        • التشفير (Encryption): لضمان سریة المعلومات.`,
  },  {
    id: 10,
    ch: 6,
    content: `عبارة عن آلیة حساب تستخدم من قبل طرف أول لحساب قیمة خاصة برسالة یرید إرسالھا ندعوھا (طبعة) وھي تساعد في التحقق من صحة الرسالة عند وصولھا للطرف الآخر:`,
    choices: ["التقطيع (Hashing)", "التوقيع (Signature)", "التشفير (Encryption)", "التهكير (Hacking)"],
    answer: 0,
    difficulty : "صعب",
    reason:
      `يتم عمل التقطیع بحساب طبعة الرسالة ذات الطول الثابت باستخدام توابع ریاضیة خاصة h(x) نطبقھا على حروف الرسالة x وتكون التوابع المستخدمة:
      سھلة الحساب، یستحیل إیجاد عكسھا، ففي حال معرفتنا بالطبعة y یصعب إیجاد الرسالة x التي حسبنا y اعتبارا منھا وفق y=h(x)
      من الصعب إیجاد 1 xمختلفة عن 2 x بحیث یكون h(x1)=h(x2)
      بعد حساب طبعة الرسالة   x نقوم بإرسالھا مع الرسالة. عند وصول الرسالة مع الطبعة إلى الطرف الآخر، یقوم الطرف الآخر بحساب جدید لطبعة الرسالة الواردة مع الرسالة، فإذا تساوت الطبعتان تكون الرسالة قد وصلت سلیمة.`,
  },  {
    id: 11,
    ch: 6,
    content: `عندما یصیب الفيروس ملفاً أو برنامجاً أو قطاعاً من قطاعات القرص الصلب یترك ضمن العنصر المصاب مجموعة من البیانات الخاصة به تسمى:`,
    choices: ["توقيع الفيروس", "آثار الفيروس", "بصمة الفيروس", "خطة الفيروس"],
    answer: 0,
    difficulty : "صعب",
    reason:
     `یعود السبب في ترك الفیروس لتوقیعه إلى حاجته للتعرف على الملفات التي أصابھا خلال جولاته ضمن الحاسوب حتى لا یعود لتكرار عمل غیر مجد بإصابتھا مرة أخرى لذلك تعتمد مضادات الفیروسات على  (Signature Scanning)للتعرف على الفیروس عن طریق توقیع الفیروس من خلال مطابقة التوقیع الذي یتركه الفیروس ضمن الملف مع قاعدة بیانات خاصة بمضاد الفیروسات تحتوي على مجموعة كبیرة من تواقیع الفیروسات.`,
  },
]
// ✅ ❌

